README.md
```mermaid
graph TD
    subgraph Child Dispostions
        B1[Child Output Disposition 1]
        B2[Child Output Disposition 2]
        B3[Child Output Disposition 3]
    end
    A((start))-->|"Data Chunk(s)"| B[Data Transformation]
    B -->|"Data Chunk(s)"| C[Output Generation]
    C -->|"Output Chunk(s)"| D[Output Transformation]
    D -->|"Output Chunk(s)"| E[Output Disposition]
    E <--> B1
    E <--> B2
    E <--> B3
    E -->|"Result Chunk(s)"| F((end))
```
